In [1]:
# Imports
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import json

import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy.types import *
from sqlalchemy_utils import create_database, database_exists
from sqlalchemy import create_engine

# Normalize Title Genres

In [2]:
title_basic = pd.read_csv('Data/title_basics.csv.gz')

In [3]:
title_basic.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0093119,movie,Grizzly II: Revenge,Grizzly II: The Predator,0,2020,NaN,74,"Horror,Music,Thriller"

In [4]:
title_basic['genres_split'] = title_basic['genres'].str.split(",")

In [5]:
exploded = title_basic.explode('genres_split')
exploded

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,Drama
...,...,...,...,...,...,...,...,...,...,...
79185,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,90,"Action,Adventure,Thriller",Action
79185,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,90,"Action,Adventure,Thriller",Adventure
79185,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,90,"Action,Adventure,Thriller",Thriller
79186,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",Drama
79186,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",History

In [6]:
unique_genres = sorted(exploded['genres_split'].unique())

# Create a new title_genres table

In [7]:
title_genres = exploded[['tconst','genres_split']].copy()
title_genres

          tconst genres_split
0      tt0035423       Comedy
0      tt0035423      Fantasy
0      tt0035423      Romance
1      tt0062336        Drama
2      tt0069049        Drama
...          ...          ...
79185  tt9916190       Action
79185  tt9916190    Adventure
79185  tt9916190     Thriller
79186  tt9916362        Drama
79186  tt9916362      History

[148065 rows x 2 columns]

In [8]:
## Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [9]:
## make new integer genre_id and drop string genres
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres = title_genres.drop(columns='genres_split')

In [10]:
# Manually make dataframe with named cols from the .keys .values
genre_lookup = pd.DataFrame ({'Genre_Name':genre_map.keys(),
                              'Genre_ID':genre_map.values()})
genre_lookup.head()

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

# Create SQL database

In [11]:
with open(r"C:\Users\black\.secret\mysql_credentials.json") as f:
    login = json.load(f)
login.keys()

dict_keys(['username', 'password'])

In [12]:
database = "TMDB"
connection = f"mysql+pymysql://{login['username']}:{login['password']}@localhost/{database}"
if database_exists(connection) == False:
    create_database(connection)
else:
    print('Database already exists!')

Database already exists!

In [13]:
engine  = create_engine(connection)

# Create SQL tables

## Title_basics SQL  table

In [14]:
title_basic.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,[Drama]
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0093119,movie,Grizzly II: Revenge,Grizzly II: The Predator,0,2020,NaN,74,"Horror,Music,Thriller","[Horror, Music, Thriller]"

In [15]:
title_basic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 79187 entries, 0 to 79186
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          79187 non-null  object
 1   titleType       79187 non-null  object
 2   primaryTitle    79187 non-null  object
 3   originalTitle   79187 non-null  object
 4   isAdult         79187 non-null  int64
 5   startYear       79187 non-null  int64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  79187 non-null  int64
 8   genres          79187 non-null  object
 9   genres_split    79187 non-null  object
dtypes: float64(1), int64(3), object(6)
memory usage: 6.0+ MB

In [16]:
title_basic.drop(columns = ['titleType', 'originalTitle','isAdult', 'endYear', 'genres', 'genres_split'], inplace=True)

In [17]:
title_basic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 79187 entries, 0 to 79186
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          79187 non-null  object
 1   primaryTitle    79187 non-null  object
 2   startYear       79187 non-null  int64
 3   runtimeMinutes  79187 non-null  int64
dtypes: int64(2), object(2)
memory usage: 2.4+ MB

In [18]:
## Example
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = title_basic['tconst'].fillna('').map(len).max()
title_len = title_basic['primaryTitle'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'runtimeMinutes':Integer()}

In [19]:
title_basic.to_sql('title_basics', engine,dtype=df_schema, if_exists='replace', index=False)

79187

In [20]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [21]:
# Display the first 5 rows
q = """
SELECT * 
FROM title_basics LIMIT 5
;"""
pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0088751,The Naked Monster,2005.0,100
4,tt0093119,Grizzly II: Revenge,2020.0,74

## Title_ratings SQL table

In [22]:
title_rating = pd.read_csv('Data/title_rating.csv.gz')

In [23]:
title_rating.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1982
1  tt0000002            5.8       265
2  tt0000005            6.2      2625
3  tt0000006            5.1       182
4  tt0000007            5.4       820

In [24]:
key_len = title_rating['tconst'].fillna('').map(len).max()
df_schema = {
    "tconst": String(key_len+1),
    "averageRating": Float(),
    "numVotes": Integer()}

In [25]:
title_rating.to_sql('title_ratings', engine, dtype = df_schema,
                   if_exists = 'replace', index =False)

502224

In [26]:
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [27]:
q = """
SELECT * 
FROM title_ratings LIMIT 5
;"""
pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1982
1  tt0000002            5.8       265
2  tt0000005            6.2      2625
3  tt0000006            5.1       182
4  tt0000007            5.4       820

## Title_genres table

In [28]:
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0069049         7

In [29]:
key_len = title_genres['tconst'].fillna('').map(len).max()
df_schema = {
    "tconst": String(key_len+1),
    "genre_id": Integer()}

In [30]:
title_genres.to_sql('title_genres', engine, dtype = df_schema,
                   if_exists = 'replace', index =False)

148065

In [31]:
q = """
SELECT * 
FROM title_genres LIMIT 5
;"""
pd.read_sql(q, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

## Genres SQL tables

In [32]:
genre_lookup.head()

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [33]:
key_len = genre_lookup['Genre_Name'].fillna('').map(len).max()
df_schema = {
      "Genre_ID":Integer(),
      "Genre_Name": String(key_len+1)}

In [34]:
genre_lookup.to_sql('genres',
              engine, 
              dtype=df_schema,
              if_exists='replace',
              index=False)

26

In [35]:
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`genre_id`);')

In [36]:
q = """
SELECT * 
FROM genres LIMIT 5
;"""
pd.read_sql(q, engine)

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

# TMDB_data SQL table

In [37]:
tmdb_data = pd.read_csv('Data/tmdb_results_combined.csv.gz')

In [38]:
tmdb_data.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.4,21.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,4.4,7.0,NaN
3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,0.0,0.0,NaN
4,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",http://www.wkw-inthemoodforlove.com/,843.0,cn,花樣年華,...,12854953.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.1,1859.0,PG

In [39]:
tmdb_data.columns

Index(['imdb_id', 'adult', 'backdrop_path', 'belongs_to_collection', 'budget',
       'genres', 'homepage', 'id', 'original_language', 'original_title',
       'overview', 'popularity', 'poster_path', 'production_companies',
       'production_countries', 'release_date', 'revenue', 'runtime',
       'spoken_languages', 'status', 'tagline', 'title', 'video',
       'vote_average', 'vote_count', 'certification'],
      dtype='object')

In [40]:
tmdb_data_df = tmdb_data[['imdb_id', 'revenue', 'budget', 'certification']]

In [41]:
tmdb_data_df = tmdb_data_df.drop_duplicates()

In [42]:
tmdb_data_df.head()

     imdb_id     revenue      budget certification
0          0         NaN         NaN           NaN
1  tt0113026         0.0  10000000.0           NaN
2  tt0113092         0.0         0.0           NaN
3  tt0116391         0.0         0.0           NaN
4  tt0118694  12854953.0    150000.0            PG

In [43]:
tmdb_data_df = tmdb_data_df.drop(0)

In [44]:
key_len = tmdb_data_df['imdb_id'].fillna('').map(len).max()
certification_len = tmdb_data_df['certification'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "imdb_id": String(key_len+1), 
    "certification": String(certification_len+1),
    'revenue':Float(),
    'budget':Float()}

In [45]:
tmdb_data_df.to_sql('tmdb_data',
              engine, 
              dtype=df_schema,
              if_exists='replace',
              index=False)

2472

In [46]:
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

In [47]:
q = """
SELECT * 
FROM tmdb_data LIMIT 5
;"""
pd.read_sql(q, engine)

     imdb_id     revenue      budget certification
0  tt0035423  76019000.0  48000000.0         PG-13
1  tt0113026         0.0  10000000.0          None
2  tt0113092         0.0         0.0          None
3  tt0114447         0.0         0.0          None
4  tt0116391         0.0         0.0          None

In [48]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_tmdb
0         genres
1   title_basics
2   title_genres
3  title_ratings
4      tmdb_data